'''
Написать программу которая будет проводить опервцию над числами.
Пользователь вводит с калвиатуры 2 числа и операцию. программа распознает операцию
и производит ее над вводимыми числами.

'''
def arithmetic (a,b,o): # a,b аргументы - числа, o - операция над ними
    if o == '+':
        return a+b
    elif o == '-':
        return a-b
    elif o == '*':
        return a*b
    elif o == '/':
        return a/b
    else:
        return 'Введена неизвесная операция'

x=int(input('введите первый аргумент: '))
y=int(input('введите второй аргумент: '))
z=input('введите операцию над аргументами: ')

print (arithmetic (x,y,z))
