'''

написать функцию XOR_cipher, принимающую 2 аргумента :
Строку которую нужно зашифромать и ключ шифрования .
функция возращает зашифрованую строку при помощи функции XOR (^), над символами строки с ключеим.

и написать функцию XOR_uncipher , котороя по зашифрованной строке и ключю востанавливает исходную строку.

'''


'''  РАЗОБРАТЬСЯ С РАБОТОЙ __XOR__   '''

class XO:
    def __xor__(self,s,k):
        self.cip = s ^ k


def XOR_cipher(s,k):
    pass


def XOR_uncipher(sl,k):
    pass


s = 'qwe'
k = 'asd'
str = XO
print(str.__xor__(s, k))

# print (chr('s') ^ chr('k'))