'''
Написать функцию bank
принимает два аргумента а (сумма вклада) и years ( количество лет)
вычисляет размер вклада через время при стартовом влажении и под 10% годовых,

'''

def bank(a,years):
    s=a
    for i in range(years):
        s=s*1.1
        print(i)
    return s

a = int(input('введите сумму вклада : '))
y = int(input('введите срок вклада ( в годах ):'))

print('Через ',y,' лет(года) вклад будет равен: ',bank(a,y))
