'''
Написать функию season, принимающую 1 аргумнт (от 1 до 12 )
и возвращающую время года. весна, лето, осень , зима
'''


def season(q):
    if q <=3 and q>0:
        return 'весна'
    elif q <=6:
        return 'лето'
    elif q<=9:
        return 'осень'
    elif q<=12:
        return 'зима'
    else:
        return 'введен неправильный номер месяца'
a=int(input('Введите число от 1 до 12 ( номер месыца ) : '))
print('Этот месяц принадлежит сезону : ',season(a))
